[
  {
    "Id": "227345",
    "ThreadId": "66868",
    "Html": "<p>I have recently taken ownership of a project with very less documentation. The first task I have on hand is to migrate it from VS 2005 to VS 2008. When I build the project (on command line or VS 2008, I get the following error.</p>\r\n<p>Cannot open include file 'atlstencil.h&quot;. No such file or directory.</p>\r\n<p>I googled and reached the home page for ATL Server Library and Tools, I downloaded the zip file, unzipped it in my project Library folder, added Existing projects (all 3) and did a rebuild. The same error. I noticed that atlstencil.h, does not ship with the download.</p>\r\n<p>Please advice me.</p>\r\n<p>Siddharth</p>",
    "PostedDate": "2009-08-24T23:40:38.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242479",
    "ThreadId": "66868",
    "Html": "<p>Hey. I am not sure if this might work. But I hope that you can just download the released files for ATL source code and put them in&nbsp;your includes folder. You can&nbsp;navigate to Tools | Option | VC directories and select includes in the drop down and find out the correct path for&nbsp;your includes. It is in this directory that&nbsp;you&nbsp;add all your includes required for ATL Server applications. Now, although, the so called description on this site does not show a complete list of released files&nbsp;for ATL Server as open source</p>\r\n<p><a href=\"http://atlserver.codeplex.com/\">http://atlserver.codeplex.com/</a></p>\r\n<p>Here is a more complete list at msdn....</p>\r\n<p><a href=\"http://msdn.microsoft.com/hi-in/library/cc714309(en-us).aspx\">http://msdn.microsoft.com/hi-in/library/cc714309(en-us).aspx</a></p>\r\n<p>Your code is looking for a atlstencil.h file which is released in this download. Also, there are three directories in the source directory. Try opening the solution files in an XML format and see if you find anything specific to VS 2005. Do not tweak the solution files manually if you do not feel confident. Just double click the solution and then see if migration wizard helps you to convert the project in to a VS 2008 one. If it does, then try and build it. to create ClStencil.exe, sproxy.exe and vcdeploy.exe and include the executables in your executables option in drop down.</p>\r\n<p>There might be other lib files I might not know of. Try and play around. See, initially just try to copy the ATL server files released as open source on this site and put them in the include directories as mentioned and then try building your own project you were trying to. See if it builds. If yes then all is fine. Else proceed with the steps I have told u. I have not tried doing it yet but will soon do it. But in the mean while. as you have it ready and the environment set up, try it out and let me know. Hopefully that should work one way or the other.</p>\r\n<p>If not, then you can compare the VS 2005 and VS 2008, to see where the ATL Server files did actually sit. If that does not work, then go further and read through the so called open source in those files to find out the includes that are not the part of ATL Server but other Visual C++ library; if at all ATL Server has any such files that were dependent on other libraries, Get all such files from VS2005 and VS2008 and compare them using win diff or File compare or a similar tool that points out the differences between them.&nbsp;</p>\r\n<p>It is not going to be difficult in terms of quality but a bit tedious by the way of quantity to search those files. Also, these are all the suggestions coming to my mind. Considering the date of your post, you might have even solved your problem. If so, please let me know...</p>\r\n<p>Thanks and Regards,</p>\r\n<p>Bhushan</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;&nbsp;</p>",
    "PostedDate": "2009-10-06T02:46:16.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]